ab.1.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.10.1
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /static/img.jpg
Document Length:        4552070 bytes

Concurrency Level:      10
Time taken for tests:   0.945 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      4552320000 bytes
HTML transferred:       4552070000 bytes
Requests per second:    1058.51 [#/sec] (mean)
Time per request:       9.447 [ms] (mean)
Time per request:       0.945 [ms] (mean, across all concurrent requests)
Transfer rate:          4705729.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     6    9   1.4      9      14
Waiting:        0    0   0.2      0       2
Total:          6    9   1.4      9      14

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     10
  80%     11
  90%     12
  95%     12
  98%     13
  99%     13
 100%     14 (longest request)