ab.3.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.10.1
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /static/img.jpg
Document Length:        4552070 bytes

Concurrency Level:      10
Time taken for tests:   0.994 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      4552320000 bytes
HTML transferred:       4552070000 bytes
Requests per second:    1005.60 [#/sec] (mean)
Time per request:       9.944 [ms] (mean)
Time per request:       0.994 [ms] (mean, across all concurrent requests)
Transfer rate:          4470503.35 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     5   10   1.4      9      15
Waiting:        0    0   0.2      0       4
Total:          6   10   1.4      9      15

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     11
  80%     11
  90%     12
  95%     13
  98%     14
  99%     14
 100%     15 (longest request)